<template>
	<div class="measurements">
		<div class="left" />
		<div class="right"> 
			<span class="right__text--bold">
				Комбинаторика
			</span>
			<span class="right__text">
				- наука, как можно понять из названия, про комбинации и различное расположение объектов. Зачем оно нужно? Ну.. например вы работаете в ресторане. К вам приходит босс и говорит: «Я хочу новый.. бургер каждый месяц, или ты уволен» и уходят. У вас есть ингредиенты [сыр, салат, помидор, бекон, котлета, горчица, кетчуп, лук], но их можно использовать только один раз в одном бургере. И так, что же мы получаем? В самом низу может быть: сыр, салат, помидор, бекон, котлета, горчица, кетчуп, лук.. И того 8 вариантов, то есть, если перебирать один ингредиент, то у вас уже есть 8 месяцев. Затем, посмотрим что дальше. Чуть выше могут быть всё, что и было снизу, но без одного и так далее. И так, но когда у вас есть 2 ингредиента… то вы перебираете все первые ингредиенты, потом меняете второй, и опять перебираете все первые ингредиенты, и так пока они не закончатся. Как можно посчитать сколько времени это займёт? Просто перемножить 8 и 7. У нас уже получается 56 месяцев. Не мало, не так ли? Но теперь представьте, у нас может быть не только 2 слоя, а целых 8! Что мы таким образом получаем? Мы получаем.. 8 * 7 * 6 * 5 * 4 * 3 * 2 * 1 или для сокращения 8! (Факториал восьми). И так сколько это будет в новых бургерах? Это будет 40320 бургеров! Учитывая что вы отдаёте бургеры раз в месяц, то… у вас есть перспектива проработать там 3360 лет…  похоже я тут застрял надолго
			</span>
			<p class="right__text">
				А теперь вот вам несколько заданий, чтобы закрепить комбинаторику. 
			</p>
			<ol>
				<li>У вас есть 6 машин, которые можно покрасить в 6 цветов: красный, чёрный, белый, синий, жёлтый и зелёный. Сколько вариантов покраски можно придумать, если машину можно покрасить только в один цвет.</li>
				<li>4 человека пришли на фотосессию. Они хотят получить как можно больше уникальных фотографий, где они все вместе стоят в ряд.</li>
				<li>Есть 3 вида чипсов, а также есть 4 соуса. Сколько комбинаций чипсов с соусами можно получить, если с каждым видом чипсов можно использовать только один соус?</li>
			</ol>
			<p class="right__text">
				Хорошо, а теперь ответы, чтобы свериться и убедиться, что всё правильно
			</p>
			<ol>
				<li>Если есть 6 машин и каждая может быть окрашена в 6 цветов, то у нас получается лёгкое равенство, где мы перемножаем все варианты, то есть 6 * 6 * 6 * 6 * 6 * 6 или 46656 вариантов</li>
				<li>Если они стоят в ряд, то мы можем перебирать кто будет первым, вторым и так далее. Первым может быть 4 человека. Вторым уже 3, а не 4. Третьим - 2, а последним только 1. Перемножим варианты и получим 4 * 3 * 2 * 1 или 24.</li>
				<li>Если на один вид чипсов можно использовать только один соус, то получается, что с первым видом можно использовать 4 соуса, со вторым - 3, а с последним - 2. Перемножая варианты, получаем 4 * 3 * 2 или 24</li>
			</ol>
		</div>
	</div>
</template>

<style lang="scss" scoped>
.left {
	position: sticky;
	top: 0;
	background-color: $technical;
	width: calc(100% - 20px);
	margin: 0 10px;
	border: 10px solid white;
	aspect-ratio: 16/9;
}

.right {
	background-color: $technical;
	width: 100%;
	padding: 10px 20px;

	&__text {
		margin: 0;

		&--bold {
			font-weight: 900;
			margin: 0;
		}
	}

	&__map {
		width: 100%;
		aspect-ratio: 100/53;
	}
}

.measurements {
	display: grid;
	grid-template-columns: 7fr 4fr;
}
</style>

<script>
import { Component, Vue } from 'vue-property-decorator';

@Component({})

export default class VidComb extends Vue {}
</script>