<template>
	<div class="measurements">
		<iframe
			class="left"
			src="https://www.youtube.com/embed/ggX0WK0i9mA"
			title="YouTube video player"
			frameborder="0"
			allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
			allowfullscreen
		/>
		<div class="right"> 
			<span class="right__text--bold">
				Часовые пояса
			</span>
			<span class="right__text">
				- это очень важная тема. Без них кто-то бы просыпался 10:10, а кто-то в 18:10, и это далеко не от сбитого режима сна. От куда они берутся? Есть освещённая часть планеты, а есть тёмная, и если мы будем расчитывать время относительно Солнца на небе, то у нас как раз и получается те самые часовые пояса. Зачем они нужны? На пример вы в Петербурге и хотите созвониться с другом, который находится в Торонто. Из-за разницы во времени он может не ответить, потому что из-за сдвига по времени, у него ночь. Так как же понять когда можно позвонить другу?
			</span>
			<img
				class="right__map"
				src="/img/time_zones.png"
			/>
			<p class="right__text">
				Для этого надо найти разницу во времени. Чтобы её найти между Питером и Торонто, надо посчитать, сколько полосок между Торонто и Санкт-Петербургом. Их 8. Эти полоски обозначают один час времени. Соответственно, между Петербургом и Торонто 8 часов разницы. Теперь, чтобы узнать время в Торонто, нарисуем координатную прямую и возьмём Питер за 0, потому что мы знаем сколько там времени, предположим, что там 12:00. Торонто находится слева по координатной прямой, значит мы вычитаем 8 часов. И соответственно, если мы вычитаем 8, то когда в Петербурге 12:00, то в Торонто 4:00. Таким образом, теперь вы сможете договориться, когда вам удобно и наконец созвониться.
			</p>
			<p class="right__text">
				А теперь вот несколько заданий, чтобы закрепить часовые пояса
			</p>
			<ol>
				<li>Если в Лондоне 12:00, то сколько будет в Пекине?</li>
				<li>Если в Нью-Йорке 15:00, Назовите город, в котором будет 23:00</li>
				<li>В Мельбурне 10:00, сколько будет в Сан Паулу?</li>
			</ol>
			<p class="right__text">
				Хорошо, а теперь ответы, чтобы свериться и убедиться, что всё правильно
			</p>
			<ol>
				<li>Между Лондоном и Пекином разница 8 часов. Теперь рисуем координатную прямую с Лондоном в центре. Пекин находится справа от Лондона, а значит мы прибавляем. 12:00 + 8:00 получается 20:00</li>
				<li>Для начала найдём разницу между Нью-Йорком и этим городом. У нас получилось 8 часов. Если мы нарисуем координатную прямую и расставим на ней времена этих двух городов, то получится что город, который надо найти, находится справа от Нью-Йорка. Теперь, чтобы его найти начнём считать вправо 8 часовых поясов. Попадаем в часовой пояс +3. Один из городов там - Сочи.</li>
				<li>Между Мельбурном и Сан Паулу разница 13 часов. Теперь рисуем координатную прямую с Мельбурном в центре. Сан Паулу находится слева от Лондона, а значит мы отнимаем. 10:00 - 13:00 = 21:00</li>
			</ol>
		</div>
	</div>
</template>

<style lang="scss" scoped>
.left {
	position: sticky;
	top: 0;
	background-color: black;
	width: calc(100% - 20px);
	margin: 0 10px;
	border: 10px solid white;
	aspect-ratio: 16/9;
}

.right {
	background-color: $technical;
	width: 100%;
	padding: 10px 20px;

	&__text {
		margin: 0;

		&--bold {
			font-weight: 900;
			margin: 0;
		}
	}

	&__map {
		width: 100%;
		aspect-ratio: 100/53;
	}
}

.measurements {
	display: grid;
	grid-template-columns: 7fr 4fr;
}
</style>

<script>
import { Component, Vue } from 'vue-property-decorator';

@Component({})

export default class VidMeas extends Vue {}
</script>