<template>
	<div class="measurements">
		<iframe
			class="left"
			src="https://www.youtube.com/embed/gh9vsJdg45U"
			title="YouTube video player"
			frameborder="0"
			allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
			allowfullscreen
		/>
		<div class="right"> 
			<span class="right__text--bold">
				Единицы измерения
			</span>
			<span class="right__text">
				- очень полезная вещь. Они нужны буквально для всего! Масса? Есть килограммы, граммы, тонны. Расстояние? Метры, километры… их много. Но в этом и есть проблема. Их много! Как же их запомнить? Сколько метров в километре? Сейчас рассмотрим. Во-первых, надо выделить интересную особенность: что у километров, что у килограммов есть приставка кило-. Что же это значит? Если обратиться к грекам, то они нам скажут, что кило - это тысяча. Это всё облегчает, ведь когда мы говорим километр, мы помучается говорим тысяча метров. Вот так вот просто! Но есть один подвох, ни в коем случае нельзя складывать километры и метры, килограммы и граммы! Сложение этих величин, можно сравнить с приготовлением салата. Представим, у вашего знакомого есть целая тарелка салата, и он очень вкусный. Вы знакомому говорите: «Вау! Прекрасный салат! А можешь сделать ещё один такой же?» И он говорит: «Без проблем!», и добавляет на другую тарелку один лист салата, и говорит: «Готово!». В итоге у нас есть не две тарелки салата, а одна тарелка салата и одна тарелка с листом салата. Тоже самое и с километрами и метрами. Если сложить пять метров и один километр, то получится не шесть километров, а один километр и 5 метров. Поэтому их совсем нельзя складывать. Что же делать? Всё переводить в одни единицы. В данном случае легче всего перевести в метры.
			</span>
			<p class="right__text">
				А теперь вот вам несколько заданий, чтобы закрепить перевод единиц измерения. 
			</p>
			<ol>
				<li>Чтобы дойти от дома до автобусной остановки, надо пройти 240 метров, а потом на автобусе вы проехали 1 километр. На сколько метров вы уехали от дома?</li>
				<li>Вы пошли в магазин за продуктами. В одной руке у вас 5 килограмм одних продуктов, в другой - 1300 грамм других продуктов. Сколько грамм вы несёте в двух руках?</li>
			</ol>
			<p class="right__text">
				Хорошо, а теперь ответы, чтобы свериться и убедиться, что всё правильно
			</p>
			<ol>
				<li>Чтобы сложить величины, надо их привести к одной. Для удобства я возьму метры. 1 километр = 1000 метров. А теперь просто складываем 1000 метров с 240 метрами и получаем 1240 метров</li>
				<li>Тут делаем так же. Чтобы сложить величины, надо их привести к одной величине. Мне удобнее перевести в граммы. 1 килограмм = 1000 грамм, соответственно 5 килограмм = 5000 грамм, а теперь просто складываем. 5000 грамм + 1300 грамм = 6300 грамм</li>
			</ol>
		</div>
	</div>
</template>

<style lang="scss" scoped>
.left {
	position: sticky;
	top: 0;
	background-color: black;
	width: calc(100% - 20px);
	margin: 0 10px;
	border: 10px solid white;
	aspect-ratio: 16/9;
}

.right {
	background-color: $technical;
	width: 100%;
	padding: 10px 20px;

	&__text {
		margin: 0;

		&--bold {
			font-weight: 900;
			margin: 0;
		}
	}

	&__map {
		width: 100%;
		aspect-ratio: 100/53;
	}
}

.measurements {
	display: grid;
	grid-template-columns: 7fr 4fr;
}
</style>

<script>
import { Component, Vue } from 'vue-property-decorator';

@Component({})

export default class VidTime extends Vue {}
</script>